defmodule CliSpinners.Spinners do
  def dots do
    %{
      interval: 80,
      frames: [
        "⠋", "⠙", "⠹", "⠸", "⠼", "⠴", "⠦", "⠧", "⠇", "⠏"
      ]
    }
  end

  def dots2 do
    %{
      interval: 80,
      frames: [
        "⣾",
        "⣽",
        "⣻",
        "⢿",
        "⡿",
        "⣟",
        "⣯",
        "⣷"

      ]}
  end 

  def dots3 do
    %{
      interval: 80,
      frames: [
        "⠋",
        "⠙",
        "⠚",
        "⠞",
        "⠖",
        "⠦",
        "⠴",
        "⠲",
        "⠳",
        "⠓"

      ]
    }

  end 

  def dots4 do
    %{
      interval: 80,
      frames: [
        "⠄",
        "⠆",
        "⠇",
        "⠋",
        "⠙",
        "⠸",
        "⠰",
        "⠠",
        "⠰",
        "⠸",
        "⠙",
        "⠋",
        "⠇",
        "⠆"

      ]
    }

  end 

  def dots5 do
    %{
      interval: 80,
      frames: [
        "⠋",
        "⠙",
        "⠚",
        "⠒",
        "⠂",
        "⠂",
        "⠒",
        "⠲",
        "⠴",
        "⠦",
        "⠖",
        "⠒",
        "⠐",
        "⠐",
        "⠒",
        "⠓",
        "⠋"

      ]
    }

  end 

  def dots6 do
    %{
      interval: 80,
      frames: [
        "⠁",
        "⠉",
        "⠙",
        "⠚",
        "⠒",
        "⠂",
        "⠂",
        "⠒",
        "⠲",
        "⠴",
        "⠤",
        "⠄",
        "⠄",
        "⠤",
        "⠴",
        "⠲",
        "⠒",
        "⠂",
        "⠂",
        "⠒",
        "⠚",
        "⠙",
        "⠉",
        "⠁"

      ]
    }

  end 

  def dots7 do
    %{
      interval: 80,
      frames: [
        "⠈",
        "⠉",
        "⠋",
        "⠓",
        "⠒",
        "⠐",
        "⠐",
        "⠒",
        "⠖",
        "⠦",
        "⠤",
        "⠠",
        "⠠",
        "⠤",
        "⠦",
        "⠖",
        "⠒",
        "⠐",
        "⠐",
        "⠒",
        "⠓",
        "⠋",
        "⠉",
        "⠈"

      ]
    }

  end 

  def dots8 do
    %{
      interval: 80,
      frames: [
        "⠁",
        "⠁",
        "⠉",
        "⠙",
        "⠚",
        "⠒",
        "⠂",
        "⠂",
        "⠒",
        "⠲",
        "⠴",
        "⠤",
        "⠄",
        "⠄",
        "⠤",
        "⠠",
        "⠠",
        "⠤",
        "⠦",
        "⠖",
        "⠒",
        "⠐",
        "⠐",
        "⠒",
        "⠓",
        "⠋",
        "⠉",
        "⠈",
        "⠈"

      ]
    }

  end 

  def dots9 do
    %{
      interval: 80,
      frames: [
        "⢹",
        "⢺",
        "⢼",
        "⣸",
        "⣇",
        "⡧",
        "⡗",
        "⡏"

      ]
    }

  end 

  def dots10 do
    %{
      interval: 80,
      frames: [
        "⢄",
        "⢂",
        "⢁",
        "⡁",
        "⡈",
        "⡐",
        "⡠"

      ]
    }

  end 

  def dots11 do
    %{
      interval: 100,
      frames: [
        "⠁",
        "⠂",
        "⠄",
        "⡀",
        "⢀",
        "⠠",
        "⠐",
        "⠈"

      ]
    }

  end 

  def dots12 do
    %{
      interval: 80,
      frames: [
        "⢀⠀",
        "⡀⠀",
        "⠄⠀",
        "⢂⠀",
        "⡂⠀",
        "⠅⠀",
        "⢃⠀",
        "⡃⠀",
        "⠍⠀",
        "⢋⠀",
        "⡋⠀",
        "⠍⠁",
        "⢋⠁",
        "⡋⠁",
        "⠍⠉",
        "⠋⠉",
        "⠋⠉",
        "⠉⠙",
        "⠉⠙",
        "⠉⠩",
        "⠈⢙",
        "⠈⡙",
        "⢈⠩",
        "⡀⢙",
        "⠄⡙",
        "⢂⠩",
        "⡂⢘",
        "⠅⡘",
        "⢃⠨",
        "⡃⢐",
        "⠍⡐",
        "⢋⠠",
        "⡋⢀",
        "⠍⡁",
        "⢋⠁",
        "⡋⠁",
        "⠍⠉",
        "⠋⠉",
        "⠋⠉",
        "⠉⠙",
        "⠉⠙",
        "⠉⠩",
        "⠈⢙",
        "⠈⡙",
        "⠈⠩",
        "⠀⢙",
        "⠀⡙",
        "⠀⠩",
        "⠀⢘",
        "⠀⡘",
        "⠀⠨",
        "⠀⢐",
        "⠀⡐",
        "⠀⠠",
        "⠀⢀",
        "⠀⡀"

      ]
    }

  end 

  def line do
    %{
      interval: 130,
      frames: [
        "-",
        "\\",
        "|",
        "/"

      ]
    }

  end 

  def line2 do
    %{
      interval: 100,
      frames: [
        "⠂",
        "-",
        "–",
        "—",
        "–",
        "-"

      ]
    }

  end 

  def pipe do
    %{
      interval: 100,
      frames: [
        "┤",
        "┘",
        "┴",
        "└",
        "├",
        "┌",
        "┬",
        "┐"

      ]
    }

  end 

  def simple_dots do
    %{
      interval: 400,
      frames: [
        ".  ",
        ".. ",
        "...",
        "   "

      ]
    }

  end 

  def simple_dots_scrolling do
    %{
      interval: 200,
      frames: [
        ".  ",
        ".. ",
        "...",
        " ..",
        "  .",
        "   "

      ]
    }

  end 

  def star do
    %{
      interval: 70,
      frames: [
        "✶",
        "✸",
        "✹",
        "✺",
        "✹",
        "✷"

      ]
    }

  end 

  def star2 do
    %{
      interval: 80,
      frames: [
        "+",
        "x",
        "*"

      ]
    }

  end 

  def flip do
    %{
      interval: 70,
      frames: [
        "_",
        "_",
        "_",
        "-",
        "`",
        "`",
        "'",
        "´",
        "-",
        "_",
        "_",
        "_"
      ]
    }
  end 

  def hamburger do
    %{
      interval: 100,
      frames: [
        "☱",
        "☲",
        "☴"

      ]
    }

  end 

  def grow_vertical do
    %{
      interval: 120,
      frames: [
        "▁",
        "▃",
        "▄",
        "▅",
        "▆",
        "▇",
        "▆",
        "▅",
        "▄",
        "▃"

      ]
    }

  end 

  def grow_horizontal do
    %{
      interval: 120,
      frames: [
        "▏",
        "▎",
        "▍",
        "▌",
        "▋",
        "▊",
        "▉",
        "▊",
        "▋",
        "▌",
        "▍",
        "▎"

      ]
    }

  end 

  def balloon do
    %{
      interval: 140,
      frames: [
        " ",
        ".",
        "o",
        "O",
        "@",
        "*",
        " "

      ]
    }

  end 

  def balloon2 do
    %{
      interval: 120,
      frames: [
        ".",
        "o",
        "O",
        "°",
        "O",
        "o",
        "."

      ]
    }

  end 

  def noise do
    %{
      interval: 100,
      frames: [
        "▓",
        "▒",
        "░"

      ]
    }

  end 

  def bounce do
    %{
      interval: 120,
      frames: [
        "⠁",
        "⠂",
        "⠄",
        "⠂"

      ]
    }

  end 

  def box_bounce do
    %{
      interval: 120,
      frames: [
        "▖",
        "▘",
        "▝",
        "▗"

      ]
    }

  end 

  def box_bounce2 do
    %{
      interval: 100,
      frames: [
        "▌",
        "▀",
        "▐",
        "▄"

      ]
    }

  end 

  def triangle do
    %{
      interval: 50,
      frames: [
        "◢",
        "◣",
        "◤",
        "◥"

      ]
    }

  end 

  def arc do
    %{
      interval: 100,
      frames: [
        "◜",
        "◠",
        "◝",
        "◞",
        "◡",
        "◟"

      ]
    }

  end 

  def circle do
    %{
      interval: 120,
      frames: [
        "◡",
        "⊙",
        "◠"

      ]
    }

  end 

  def square_corners do
    %{
      interval: 180,
      frames: [
        "◰",
        "◳",
        "◲",
        "◱"

      ]
    }

  end 

  def circle_quarters do
    %{
      interval: 120,
      frames: [
        "◴",
        "◷",
        "◶",
        "◵"

      ]
    }

  end 

  def circle_halves do
    %{
      interval: 50,
      frames: [
        "◐",
        "◓",
        "◑",
        "◒"

      ]
    }

  end 

  def squish do
    %{
      interval: 100,
      frames: [
        "╫",
        "╪"

      ]
    }

  end 

  def toggle do
    %{
      interval: 250,
      frames: [
        "⊶",
        "⊷"

      ]
    }

  end 

  def toggle2 do
    %{
      interval: 80,
      frames: [
        "▫",
        "▪"

      ]
    }

  end 

  def toggle3 do
    %{
      interval: 120,
      frames: [
        "□",
        "■"

      ]
    }

  end 

  def toggle4 do
    %{
      interval: 100,
      frames: [
        "■",
        "□",
        "▪",
        "▫"

      ]
    }

  end 

  def toggle5 do
    %{
      interval: 100,
      frames: [
        "▮",
        "▯"

      ]
    }

  end 

  def toggle6 do
    %{
      interval: 300,
      frames: [
        "ဝ",
        "၀"

      ]
    }

  end 

  def toggle7 do
    %{
      interval: 80,
      frames: [
        "⦾",
        "⦿"

      ]
    }

  end 

  def toggle8 do
    %{
      interval: 100,
      frames: [
        "◍",
        "◌"

      ]
    }

  end 

  def toggle9 do
    %{
      interval: 100,
      frames: [
        "◉",
        "◎"

      ]
    }

  end 

  def toggle10 do
    %{
      interval: 100,
      frames: [
        "㊂",
        "㊀",
        "㊁"

      ]
    }

  end 

  def toggle11 do
    %{
      interval: 50,
      frames: [
        "⧇",
        "⧆"

      ]
    }

  end 

  def toggle12 do
    %{
      interval: 120,
      frames: [
        "☗",
        "☖"

      ]
    }

  end 

  def toggle13 do
    %{
      interval: 80,
      frames: [
        "=",
        "*",
        "-"

      ]
    }

  end 

  def arrow do
    %{
      interval: 100,
      frames: [
        "←",
        "↖",
        "↑",
        "↗",
        "→",
        "↘",
        "↓",
        "↙"

      ]
    }

  end 

  def arrow2 do
    %{
      interval: 80,
      frames: [
        "⬆️ ",
        "↗️ ",
        "➡️ ",
        "↘️ ",
        "⬇️ ",
        "↙️ ",
        "⬅️ ",
        "↖️ "

      ]
    }

  end 

  def arrow3 do
    %{
      interval: 120,
      frames: [
        "▹▹▹▹▹",
        "▸▹▹▹▹",
        "▹▸▹▹▹",
        "▹▹▸▹▹",
        "▹▹▹▸▹",
        "▹▹▹▹▸"

      ]
    }

  end 

  def bouncing_bar do
    %{
      interval: 80,
      frames: [
        "[     ]",
        "[   = ]",
        "[  == ]",
        "[ === ]",
        "[==== ]",
        "[===  ]",
        "[==   ]",
        "[=    ]"

      ]
    }

  end 

  def bouncing_ball do
    %{
      interval: 80,
      frames: [
        "( ●     )",
        "(  ●    )",
        "(   ●   )",
        "(    ●  )",
        "(     ● )",
        "(    ●  )",
        "(   ●   )",
        "(  ●    )",
        "( ●     )",
        "(●      )"

      ]
    }

  end 

  def smiley do
    %{
      interval: 200,
      frames: [
        "😄 ",
        "😝 "

      ]
    }

  end 

  def monkey do
    %{
      interval: 300,
      frames: [
        "🙈 ",
        "🙈 ",
        "🙉 ",
        "🙊 "

      ]
    }

  end 

  def hearts do
    %{
      interval: 100,
      frames: [
        "💛 ",
        "💙 ",
        "💜 ",
        "💚 ",
        "❤️ "

      ]
    }

  end 

  def clock do
    %{
      interval: 100,
      frames: [
        "🕐 ",
        "🕑 ",
        "🕒 ",
        "🕓 ",
        "🕔 ",
        "🕕 ",
        "🕖 ",
        "🕗 ",
        "🕘 ",
        "🕙 ",
        "🕚 "

      ]
    }

  end 

  def earth do
    %{
      interval: 180,
      frames: [
        "🌍 ",
        "🌎 ",
        "🌏 "

      ]
    }

  end 

  def moon do
    %{
      interval: 80,
      frames: [
        "🌑 ",
        "🌒 ",
        "🌓 ",
        "🌔 ",
        "🌕 ",
        "🌖 ",
        "🌗 ",
        "🌘 "

      ]
    }

  end 

  def runner do
    %{
      interval: 140,
      frames: [
        "🚶",
        "🏃" 

      ]
    }

  end 

  def pong do
    %{
      interval: 80,
      frames: [
        "▐⠂       ▌",
        "▐⠈       ▌",
        "▐ ⠂      ▌",
        "▐ ⠠      ▌",
        "▐  ⡀     ▌",
        "▐  ⠠     ▌",
        "▐   ⠂    ▌",
        "▐   ⠈    ▌",
        "▐    ⠂   ▌",
        "▐    ⠠   ▌",
        "▐     ⡀  ▌",
        "▐     ⠠  ▌",
        "▐      ⠂ ▌",
        "▐      ⠈ ▌",
        "▐       ⠂▌",
        "▐       ⠠▌",
        "▐       ⡀▌",
        "▐      ⠠ ▌",
        "▐      ⠂ ▌",
        "▐     ⠈  ▌",
        "▐     ⠂  ▌",
        "▐    ⠠   ▌",
        "▐    ⡀   ▌",
        "▐   ⠠    ▌",
        "▐   ⠂    ▌",
        "▐  ⠈     ▌",
        "▐  ⠂     ▌",
        "▐ ⠠      ▌",
        "▐ ⡀      ▌",
        "▐⠠       ▌"

      ]
    }

  end 

  def shark do
    %{
      interval: 120,
      frames: [
        "▐|\\____________▌",
        "▐_|\\___________▌",
        "▐__|\\__________▌",
        "▐___|\\_________▌",
        "▐____|\\________▌",
        "▐_____|\\_______▌",
        "▐______|\\______▌",
        "▐_______|\\_____▌",
        "▐________|\\____▌",
        "▐_________|\\___▌",
        "▐__________|\\__▌",
        "▐___________|\\_▌",
        "▐____________|\\▌",
        "▐____________/|▌",
        "▐___________/|_▌",
        "▐__________/|__▌",
        "▐_________/|___▌",
        "▐________/|____▌",
        "▐_______/|_____▌",
        "▐______/|______▌",
        "▐_____/|_______▌",
        "▐____/|________▌",
        "▐___/|_________▌",
        "▐__/|__________▌",
        "▐_/|___________▌",
        "▐/|____________▌"

      ]
    }

  end 

  def dqpb do
    %{
      interval: 100,
      frames: [
        "d",
        "q",
        "p",
        "b"

      ]
    }
  end 

end
